# реализация алгоритма Дейкстры для двух узлов

n = [[0,1,2,-1],[1,0,2,3],[2,2,0,4],[-1,3,4,0]]  # массив смежности
x = int(input('введите номер первой вершины '))
y = int(input('введите номер второй вершины '))
a = [0]   # лист, куда мы добавляем присвоенные каждому узлу числа (минимальное расстояние + предыдущее минимальное расстояние)
          # первому узлу присваиваем расстояние ноль и заносим в лист
c = 0
rez = 0
for i in range(x, y + 1):
    for j in range(1,len(n)-1):
        if i == j or i == j + 1: # исключаем обработку самих узлов
            continue
        if n[i][j] < 0 or n[i][j+1] < 0:  # если между узлами нет связи идем дальше
            continue
        else:
            c = min(n[i][j] + rez, n[i][j + 1] + rez)  # сравниваем расстояния + предыдущий минимум от одного узла до ближайших
        a.append(c)  # в лист заносим получившееся минимальное значение (число узла)
        rez = c  # в переменной сохраняем предыдущий минимальный путь
        c = 0    # обнуляем счетчик
print(a)
print(a[-1])     # последнее число в листе и будет кратчайшим путем из первого узла в последний