# таблица умножеения второй вариант

if __name__ == '__main__':

    a = 1
    b = 10

    print('   ', end=' ')
    for i in range(a, b):
        print('%4d' % i, end='' )
    print()
    for i in range(a, b):
        print('%4d' % i, end='')
        for j in range(a, b):
            print('%4d' % (i * j), end='')
        print()

# Смещение крайнего цикла for  дает нам возможность перемножать
# i из предидущего цикла c J из крайнего цикла
# Кстати именно поэтому появляется первый столбик
# ведь сначала выводится этот элемент и лишь потом перемножается  с J
# Крайний принт переводит каретку